---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.Pulsation
source: html/002df2ff-6409-de37-54cb-3e0b08fcc98f.htm
---
# Autodesk.Revit.DB.SpecTypeId.Pulsation Property

Pulsation, in discipline Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId Pulsation { get; }
```